// Создать класс Device, который имеет параметр isOn (по
// умолчанию false), метод callSmbd, который принимает имя
// вызываемого абонента и метод switchDevice, который
// переключает параметр isOn. Позвонить абоненту можно
// только тогда, когда параметр isOn == true, иначе вывести
// сообщение, что звонок невозможен. Необходимо также
// создать классы Smartphone(принимает имя и диагональ
// экрана(не может быть больше 8)) и Tablet(принимает имя и
// диагональ экрана (не может быть меньше 8)), которые
// наследуют от класса Device.


